Revit 2026 API

# AdvancedWoodWoodGrowthPerlinProf Property

---

The property labeled "Profile for growth perlin noise" from the "AdvancedWood" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string WoodGrowthPerlinProf { get; }
```
```vb
Public Shared ReadOnly Property WoodGrowthPerlinProf As String
	Get
```
```cpp
public:
static property String^ WoodGrowthPerlinProf {
	String^ get ();
}
```
```fsharp
static member WoodGrowthPerlinProf : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDouble".

#### Reference

AdvancedWood Class

Autodesk.Revit.DB.Visual Namespace